### Sorting in Pandas

There are two kinds of sorting available in pandas:
1. sort by index
2. sort by value

In [3]:
#import the libraries
import pandas as pd 
import numpy as np

#### Sorting for Series

##### Sort by index

* Sorting by index can be done by using sort_index command.

In [7]:
p=pd.Series([67,45,23,6,12,57,78],index=["p","r","a","j","w","a","l"])
p

p    67
r    45
a    23
j     6
w    12
a    57
l    78
dtype: int64

In [8]:
p.sort_index()

a    23
a    57
j     6
l    78
p    67
r    45
w    12
dtype: int64

#### Sorting by Value
Sorting by value can be done by sort_value command.

In [10]:
p.sort_values()

j     6
w    12
a    23
r    45
a    57
p    67
l    78
dtype: int64

#### Sorting for DataFrame

#### Sorting by index

In [13]:
data = {'Name':pd.Series(['arthur','tommy','Robin','jackson','James','danny']),'Age':pd.Series([25,26,29,27,23,21]),'Rating':pd.Series([4.23,2.35,1.56,3.20,4.62,3.99])}
df = pd.DataFrame(data,index=[5,3,2,4,1,0])
df

      Name  Age  Rating
5    danny   21    3.99
3  jackson   27    3.20
2    Robin   29    1.56
4    James   23    4.62
1    tommy   26    2.35
0   arthur   25    4.23

In [14]:
df.sort_index()

      Name  Age  Rating
0   arthur   25    4.23
1    tommy   26    2.35
2    Robin   29    1.56
3  jackson   27    3.20
4    James   23    4.62
5    danny   21    3.99

#### Sort the Data By Columns

In [16]:
df.sort_index(axis=1)

   Age     Name  Rating
5   21    danny    3.99
3   27  jackson    3.20
2   29    Robin    1.56
4   23    James    4.62
1   26    tommy    2.35
0   25   arthur    4.23

##### By default, sorting is sorted in ascending order.But sorting can also be done in descending order, by using ascending = False.

In [18]:
df.sort_index(ascending=False)

      Name  Age  Rating
5    danny   21    3.99
4    James   23    4.62
3  jackson   27    3.20
2    Robin   29    1.56
1    tommy   26    2.35
0   arthur   25    4.23

#### Sorting the values by Age column

In [20]:
df.sort_values(by="Age")

      Name  Age  Rating
5    danny   21    3.99
4    James   23    4.62
0   arthur   25    4.23
1    tommy   26    2.35
3  jackson   27    3.20
2    Robin   29    1.56

#### Ascending Order

In [22]:
df.sort_values(by="Age",ascending=True)

      Name  Age  Rating
5    danny   21    3.99
4    James   23    4.62
0   arthur   25    4.23
1    tommy   26    2.35
3  jackson   27    3.20
2    Robin   29    1.56

#### Descending Order

In [24]:
df.sort_values(by="Age",ascending=False)

      Name  Age  Rating
2    Robin   29    1.56
3  jackson   27    3.20
1    tommy   26    2.35
0   arthur   25    4.23
4    James   23    4.62
5    danny   21    3.99